Repository: jouissancetka/LMW
Catalog: omegat/project_save.tmx
Source language: zh_cn
Languages: en_us

source: 少年像狐狸似的左看右看，看起来贼兮兮的，最后确定一个方向，拔起腿就迅速的朝那个方向奔跑过去。
en_us: Like a fox, the young man was looking left and right, as if a theif (贼兮兮). Once he determined a direction, he made a dash towards it.

source: 少年分明是一个人类，而且还是一名十级丹师，实力不低却也不高，他们这里每个人都可以用一只手捏死他，因为三人都有十一阶修为。
en_us: The young man was clearly a human and a level ten mage at that, not so high but not so low. Everyone here could have killed him with one hand, since they were all level eleven practitioners.

source: 少年心虚的笑了笑。
en_us: The young man smiled guiltly.

source: 少年想了想还是先把人移出大树下，万一人没死，一道雷把他劈死怎么办？
en_us: The young man thought for a moment before deciding to move his companion out from under the tree. It would be terrible if he had survived, only to get struck dead by lightning.

source: 少年拍拍男人的肩膀，兴致勃勃的问道。
en_us: The young man patted the man's shoulder as he excitedly asked.

source: 少年摸摸鼻子，“我估摸着，我要是把手伸过去它们准把我的爪子砍掉，所以还是算了吧。”他可不想吃生骨丹。
en_us: The young man touched his nose, "I reckon that they will definitely cut off my claws if I stretch my hand out. So it's better to let it be ba." He did not wish to eat the Bone Growth Pill.

source: 少年撇嘴，连忙跟上去，他开个玩笑嘛！
en_us: The young man pouted, hurrying after him. It was just a joke!

source: 少年突然冲他甜甜一笑。
en_us: The young man gave him a sweet smile.

source: 少年笑了笑，露出一口白牙，“其实我还有一个铜板，他现在就在这里，你要杀我的话，得闲问过他的同意才行。”
en_us: The young man smiled, showing his white teeth, "Actually, I have a comrade too and his right there. If you want to kill me, you'll have to speak with him first."

source: 少年笑眯眯的回道：“你没发现吗？
en_us: The young man replied with a smile, "You didn't notice?"

source: 少年表示真是躺着也中枪，其实他根本不知道这里发生了什么事，只是刚被传送过来就听到一个桀桀的怪笑声，说什么除了他们就没有其他人，难道他不是人吗？
en_us: The young man was the perfect example of 'getting-hit-while-standing-around' (躺着也中枪), in reality he knew nothing of what was going on. Just as he was transported here, he heard a creepy weird laugh saying something like, other than them, there was no one else here. Was he not a person too?

source: 少年，火焰。
en_us: Young man and flames.

source: 就像一缸能装一吨的水，内丹里剩下的一半能量连水缸的十分之一都没有，要不是因为贪狼是篮球的兄弟，他说不定真会忍受不了诱惑将贪狼的内丹吸收了。
en_us: Like a bucket that could fill a ton of water (吨), the energies left in that Life Crystal couldn't even fill a tenth of it. If it wasn't for the fact that the Wolf of Gluttony was LanQiu's brother, he would have really lost to the temptation of absorbing it as well.

source: 就像修炼者进重力屋锻炼肉体的强度，丹师的根本在于灵魂，灵魂锻炼得越发坚韧，实力就越强，再修习灵魂技法，便可达到事半功倍的效果。
en_us: Like how practitioners used the Gravity Room to train their bodies, mage’s focused on their soul. If they made their soul more resilient, it would be strengthened. Then, if they trained Soul Techniques, they could achieve more with less effort.

source: 就在两头牛角妖兽压低后腿准一跃而起时，周围的空间突然扭曲了起来，接着便张开一道黑漆漆的裂缝，空间之力霎时蔓延而出。
en_us: Just as the two bull-horned demon beast tensed in preparation to lunge, the air around them began to distort. Then, a pitch black gap tore open the air and spacial energy (空间之力) seeped out.

source: 就在他们离开南陆的第二天，游震天亲自来到星罗城，身边还跟着一个神秘人物，双双住进了城主府，上下顿时战战兢兢。
en_us: The day after they left the South Continent, You ZhenTian personally came to Xing Luo City with a mysterious person. The two entered the City Master's estate and left terrified people in their wake.

source: 就在他们为活命而兴奋的时候，前方突然出现一个黑色的漩涡，漩涡中缓缓走出一个男人，俊美蛊惑的容颜勾着一抹邪异的笑容，手上拿着一把刀，好像在这里等他们很久一样，黑色的眼睛时不时闪烁着几缕妖异的紫色火焰。
en_us: Just when they were feeling overjoyed over living, a black vortex suddenly appeared in front of them. A man slowly walked out from the vortex, a sinister smile on his pretty and bewitching face. He held a knife in his hand, and it seemed as if he had been waiting here for them for a long time. From time to time, purple demonic flames would flash through his black eyes.

source: 就在他们后退的时候，一只水妖突然趴在灵草田里，随手拔起一株骷髅花草便塞进嘴里。
en_us: Just when they were retreating, a Water Demon suddenly crawled into the magic herb field and randomly picked up a Skull Herb before stuffing it into its mouth.

source: 就在他们开始找水元素之心的时候，在一群人先后赶到黑色大峡谷，别看游小默和凌霄轻易的找到了入口，实际上若不是地图这把钥匙，就算他们在峡谷待上百年也未必能找到。
en_us: Ever since they started searching for the Water Elemental Essence and they rushed to the Black Canyon with a bunch of other people, don't look at how easily You XiaoMo and Ling Xiao found the entrance. In reality, if it weren't for map, which was the key, even if they had stayed for a century in the Black Canyon, they wouldn't necessarily have found it.

source: 就在他们离开没多久，心灵花草原来的主人却意外的找上门来了，原因是灵草堂有个伙计不小心说漏嘴，在李管事嘱咐下面的人之前，心灵花草已运到的消息就传到那个人耳里了。
en_us: Not long after they left, the original owner of the Heart Flower Herb unexpectedly showed up. It turned out that an assistant in the Magic Herb Shop accidentally let it slip, and before Manager Li could tell his subordinates not to say anything, the news that the Heart Flower Herb had already arrived reached that person's ears.

source: 就在他炼化白虎的尸体即将完成的时候，有人闯进他的感应范围内。
en_us: Just as he was about to finish with the White Tiger's body, someone entered his sensory range.

source: 就在他的身影消失在楼梯间之前，一个与他擦肩而过，准备离开酒楼的老者突然转过身，若有所思的看了他的背影一眼，旋即转身走向地下赌场的入口。
en_us: Just as his figure disappeared up the stairs, an elderly man who had brushed past him, prepared to leave the hotel, suddenly turned, contemplatively gazing at him before turning and heading for the entrance of the casino.

source: 就在众人与水妖打得火热的时候，一道身影却趁大家不注意的时候偷偷的跑向灵草田，这个人就是江流。
en_us: Just when the battle against the Water Demons was at its peak, a figure darted sneakily towards the magic herb field when nobody was paying attention. That person was Jiang Liu.

source: 就在众人以为游小默会躲开的时候，他竟然抬起手去挡……
en_us: Just when everyone thought You XiaoMo would dodge, he instead raised his arm to block...

source: 就在众人以为那名弟子会死的时候，一阵强光突然出现在两者之间，水妖刚好扑在强光上，结果被反弹了出去，下一秒，强光出现的地方便化为两道紧紧贴在一起的人影。
en_us: Just when people thought that the disciple would die, a strong ray of light suddenly appeared between the two. The water demon just happened to hit the light and was rebounded. In the next second, two figures that were closely stuck together appeared in the place where the strong ray of light was.

source: 就在众人惊叹的看着童越煦的时候，场上突然响起一阵娇喝声。
en_us: Just as everyone was looking at Tong YueXu in surprise, another cry of success rang out.

source: 就在众人期待的时候，石头上方探出一颗黑色的脑袋，露出让牛徐阳三人熟悉无比的脸庞，莫雪和莫菲的笑容顿时僵在脸上。
en_us: The moment everyone was expecting arrived as a black head was poked out from above the stone, revealing a face that was incomparably familiar to Niu XuYang and the two ladies. Mo Xue and Mo Fei's smiles immediately froze on their faces.

source: 就在它们离目标只剩下三米的距离时，少年突然回头了，眼中带着明显的不耐烦，随手朝两只一挥，一股强大的灵魂之力霎时喷薄而出，铺天盖地的朝它们袭击而去。
en_us: Just as they were three meters away from their target, the young man suddenly turned his head, eyes clearly filled with annoyance. He waved a hand at the two, and a massive wave of soul force poured out, raging towards the demon beasts.

source: 就在尖锥即将碰到凌霄时，静立的身影一瞬间消失了。
en_us: Ling Xiao's calm and still figure disappeared in an instant just as the razor-sharp awl was about to bore into him.

source: 就在房间门关上没多久，隔壁房间的门突然打开了。
en_us: It wasn't long before the door was closed that the door beside them opened.

source: 就在火焰即将缠上凌霄的时刻，缝隙之间，众人只听到‘噗嗤’一声，另一股更凶猛的红色火焰突然爆发了，像一头凶兽扑上姬芮的火焰……
en_us: Just as the flame was about to touch Ling Xiao, in that small crack, a fiercier red flame exploded. All the crowd heard was a 'titter' (‘噗嗤) before it pounced on Ji Rui's flame like a beast...

source: 就在牛徐阳着急得不知怎么办的时候，胳膊被莫雪用力的掐了一下，然后他就发现莫雪两姐妹在看一个男人，长得仿佛天神下凡，她们眼睛几乎看直了，接着听到莫雪让他一定要邀请这个男人加入他们的队伍。
en_us: Just as Niu XuYang was in a panic about what to do, he was pinched in the arms by Mo Xue. That was when he saw the sisters staring at a man who looked as if God has descended from heaven. They're eyes were fixated on him, and the next thing he knew, they were insisted on getting his man to join their team.

source: 就在莫景离开一个时辰后，一个陌生的黑衣人出现在他先前站立的地方，既不是邢七，也不是他的同伴。
en_us: One hour after Mo Jing left, a stranger wearing all black appeared in the place that he was standing before. It wasn't Xing Qi, nor was it his companion.

source: 就在莫雪的话说完没多久，凌霄出现了。
en_us: It wasn't long after Mo Xue's talk that Ling Xiao appeared.

source: 就在这时，城主府一名守卫突然急冲冲走进来，不过在门口就被本家的侍卫给拦了下来。
en_us: That was when a guard of the estate rushed inside, but he was stopped at the door by a housecarl of the main family.

source: 就在这时，一个带着些许恶意的声音飘了过来，淡淡的声音，虽然没有特指，但是游小默听的出来这人是在骂他。
en_us: It was at this moment that a voice with a slight evilness to it appeared. Although it wasn't directed at anyone in particular, You XiaoMo knew that they were cursing him.

source: 就在这时，一个细小的啃咬声从铁锤底下细细碎碎的传出来，声音越来越大，终于引起黄鼠狼的注意，不等他移开铁锤一看究竟，一颗金色的脑对突然从铁锤下面探出来，正是他以为被砸成肉饼的吞金兽。
en_us: At that moment, a soft gnawing sound drifted over in bits and pieces out from the bottom of the hammer. The sound grew louder and louder. Finally, it caught the attention of the Ground Squirrel Beast. Before he could move the hammer away and see happened, a golden head suddenly came out from the bottom of the hammer. It was the Metal Swallowing Beast which he thought was smashed into minced meat.

source: 就在这时，一直安静匍匐在他头顶的小乓突然飞了起来，以迅雷不及掩耳之势迅速的咬了星罗城主的手指一口，伤口很小，但是星罗城主却惨叫一声，捂着流血不止的手指迅速的往后退。
en_us: Just at this moment, Xiao Pang (小乓), who had been quietly perching on his head suddenly flew up and bit down onto the Starfall City Master's finger with a lightning-fast snap (以迅雷不及掩耳之). The bite wound was very small, yet the Starfall City Lord released a miserable shriek as he pressed down on his finger which was bleeding non-stop and rapidly retreated.

source: 就在这时，一股突然闯进来的力量出现在他的身体里。
en_us: That was when an intruding power appeared inside of him.

source: 就在这时，一道带着恒古味道的诱惑气息突然以小岛为中心向四周扩散，原本安静下去的水鲨突然又躁动了起来。
en_us: But then, an enticing, persistent scent abruptly spread out from the center of the small island, and the sharks, which had originally calmed down, started to move restlessly again.

source: 就在这时，一道轻狂的叹息声音自头顶的天空响起，声音略微低沉，好似无边无际，像在众人耳边响起一样。
en_us: That was when a prideful sigh sounded above their heads. The voice was rather low, seemingly coming from everywhere and nowhere at once.

source: 就在这时，他们的手下终于赶过来了。
en_us: Just at this moment, their subordinates finally arrived.

source: 就在这时，他右手边那名强者乙却往后退了一步，动作虽然细小，但是却被他发现了，不禁皱起眉。
en_us: Just then, the one on his right, expert^2 (乙) took a step back. Although it was small, he noticed and frowned at him.

source: 就在这时，怀里一直蛰伏不动的吞金兽和金翅虫突然探出了脑袋，眼睛发绿似得盯着糖葫芦，趁游小默没注意的时候，吞金兽突然伸长脖子咬住其中一颗，然后立马缩回去和两只金翅虫一起分享。
en_us: Just then, the Metal Swallowing Beast and the Golden Winged Insect, who had been lying in wait in his arms, suddenly peaked out their heads. With eyes green with greed, the Metal Swallowing Beast quickly stretched out his neck to take a bite, when You XiaoMo wasn't looking. Then he went back to share it with the Golden Winged Insects.

source: 就在这时，放佛为了应景一般，斗篷人周遭的水动荡了起来。
en_us: At this moment, the water around the cloaked man became turbulent as if it was following the occasion (应景).

source: 就在这时，旁边几个人小声的对话又突然引起他们的注意。
en_us: Just at this moment, a few whispers of conversation suddenly caught their attention.

source: 就在这时，晶石板出现一行字。
en_us: At that moment, a row of words appeared on the spirit gem board.

source: 就在这时，站在不远处的青秋突然朝游小默走了过去，看她的样子，似乎想和游小默一起进重力屋。
en_us: Then, Qing Qiu who wasn’t far suddenly began walking towards You XiaoMo. She seemed to want to go into the Gravity Room with You XiaoMo.

source: 就在这时，终于看不下去的凌霄强行掰住游小默的下巴，让他的脸对着游君其的脸，说：“他长得像谁？”
en_us: At that moment, Ling Xiao couldn't stand it any longer and forcefully grabbed You XiaoMo's chin, turning it to face You JunQi's face. "Who does he look like?"

source: 就在这时，翻滚着寒气泡的湖泊突然发出一丝细微的动静，下一秒，一只水妖从湖底浮出水面。
en_us: At that moment, a slight movement suddenly came from the lake which had constantly been boiling with bubbles of cold air. In the next second, a Water Demon emerged from the bottom of the lake.

source: 就在这时，莫雪气急败坏的声音突然响了起来，“牛徐阳，你还愣着干嘛，还不快来救我。”
en_us: At that moment, Mo Xue's flustered and exasperated voice suddenly rang out. "Niu XuYang, what are you standing around in a daze for! Why aren't you coming to rescue me."

source: 就在这时，雅间的门被人从外面推开了，一道白色的倩影走了出来，正是酒楼的老板娘，不知在外面站了多久。
en_us: It was then that the door to the elegant room was opened from the outside, and a white figure walked in. It was the boss of the tavern. Who knows how long she had been standing there?

source: 就在这时，青年身后突然响起一阵脚步声，伴随着一个嘲讽的声音，清晰无比的传至青年耳中。
en_us: Just at this moment, as set of footsteps suddenly sounded from behind the youth. Accompanied with a a ridiculing voice, it was incomparably clear and distinct as it drifted into the youth's ears.

source: 就在这时，黄鼠兽突然慌慌张张的跑出来，没等他开口，凌霄便皱了下眉，深邃的目光移到洞府外面。
en_us: It was then when the Weasel Beast came running in a flurry. Before he spoke, Ling Xiao furrowed his brows and looked intensely at the outskirts of the cave.

source: 就在这时，黑蜘蛛的人突然动了，一道道身影化作流光朝不同的方向疾驰而去，包括那名强者，他的速度最快，眼看就要冲出洞府的大门，一道威压夹着攻击之力从天而降，顿时把他砸得七晕八素，轰的一声便摔在大门口。
en_us: Just at that moment, the Black Spider suddenly all moved, turning into streaks of shadows, headed towards different directions. Even that expert tried to flee. He was also the fastest, but just as he was about to exit, a pressure along with an attack came from above and smashed him silly. With a loud thud, he was smashed up against the door.

source: 就如同凌霄将他们放出来的目的差不多。
en_us: It was the same reason Ling Xiao had to release him.

source: 就是不知道他们对于这个突然冒出来的强者会有什么样的想法。
en_us: It was just that they did not know what opinion the fractions would have about this expert who had suddenly appeared.

source: 就是再来十个，游小默也觉得他能游刃有余。
en_us: Even if there was ten more, You XiaoMo could've still handled it with ease.

source: 就是因为实力不够，邢七二人再加上一个黑熊，他敢保证只要他敢闯城门，邢七三人应该能把他逮着了。
en_us: It was because of his lack of strength. With the addition of Hei Xiong to the team of Xing Qi and Gao Yan, he was certain that the group of three would be able to capture him as long as he dared to break through the city gates.

source: 就知道狗嘴吐不出象牙，他太天真了。
en_us: He should have known that nothing good would come out of that mouth of his. He was too naive.

source: 就算他有，空间里也是未成熟或者存量只有一株，这种情形，游小默只能望洋兴叹。
en_us: Even the ones he had he only had immature ones, or a stock of only one stalk. In such a circumstance, You XiaoMo could only sigh.

source: 就算他真的隐藏了实力，也不可能同时对付得了滕家和柴家的十几个人吧？
en_us: Even if he hid his true ability, it wasn’t possible that he could simultaneously deal with more than ten people from the Teng and Chai families, right?

source: 就算要表达对他的歉意也不需要行这么大的礼吧？
en_us: Even if you wanted to express your apology, you don't need to be so courteous ba?

source: 就这忍了半个多月，机会终于来临了。
en_us: He had endured it for half a month, but his opportunity had finally arrived.

source: 就这样又过了一个月，游小默终于晋级为六级丹师了。
en_us: So, a month passed quickly without disruption, and You XiaoMo finally achieved a breakthrough to level six.

source: 就这样，它在不甘之中被他的仇人结束了生命。
en_us: Just like that, in a unwillingness, it's life was ended by his enemy.

source: 就这样，银戈光明正大的带着风迟云下山了。
en_us: Yin Ge openly brought Feng ChiYun down the mountain in this manner.

source: 尽管他们不是在雷云的正下方，但是黄鼠獣仍然能感觉到那股让他们无法喘息的讶异，在这股毁天灭地的力量面前，他们显得尤其渺小。
en_us: Although they are not directly below the thundercloud, the Ground Squirrel Beast could still feel the astonishment that made it unable to breathe. They appeared particularly insignificant before the might of this apocalyptic (毁天灭地) force.

source: 尽管他的实力不是这里最出众的，但是那股冰冷的气质却特别突出。
en_us: Even though he wasn't the strongest here, but his cold demeanor was very eye-catching.

source: 尽管如此，两人还是没有立刻相信斗篷人的话，因为凌霄看起来根本不像受了内伤，很有可能是斗篷人为了激他们出手设下的陷阱。
en_us: Nevertheless, they did not immediately believe the cloaked man's words, because Ling Xiao did not seem like he was suffering from an internal injury. It was likely that the cloaked man had set a trap in order to incite them into making a move.

source: 尽管如此，却也改变不了东洲曾经是强者的世界这一事实，所以藏宝图如果真的指示着东洲，那么九成九是好东西，说不定是远古哪位强者前辈留下来的洞府。
en_us: Nevertheless, this could not change the fact that Dong Zhou was once a world of strong experts. Therefore, if the treasure map was really marking out Dong Zhou, then there was a ninety percent chance that it was something good. Maybe it was a legendary adobe left behind by an strong predecessor in ancient times.

source: 尽管如此，柴正还是觉得很不是滋味。
en_us: Even so, Chai Zheng was still displeased.

source: 尽管如此，游小默和凌霄并不准备立刻回中天。
en_us: Even though it was like this, You XiaoMo and Ling Xiao still didn't plan on returning to Zhong Tian instantly.

source: 尽管如此，通天大陆还是有人养着杂色的金翅虫，然后将它们产下得金丝以高价卖出去。
en_us: Even so, there were still people who raised those impure Golden Winged Insects and sold their golden threads for an exorbitant price.

source: 尽管没有完成吸收精血中的能量，但是那一点就已经让他受益匪浅。
en_us: Even though he wasn't able to completely absorb the energy from the Life Blood, he was already able to reap the benefits from the little amount he had been able to.

source: 尽管游震天不想让人知道风迟云的存在，但是眼下也没有其他办法，那人既然会拿走玉盒子，显然知道风迟云的情况，他不得不怀疑，赤血家族传家之宝的持有者和他的同伴在很早之前就已经盯上赤血家族。
en_us: Even though You ZhenTian didn't want anyone knowing of Feng ChiYun's existence, he didn't have any other choice. Since that person had taken the jade box, they knew Feng ChiYun's situation. He couldn't help but suspect that the possessor of the ChiXue family heirloom and his companions had set their eyes on the ChiXue Family long ago.

source: 届时他不仅有了和古玛部落谈判的资本，古玛部落想要打水西部落的主要也要掂量一下。
en_us: By then, he would have the capital to negotiate with the Guma Tribe and they would have to think twice about attacking them.

source: 屋下的人已经被屋顶的动静给惊动了，包括正好回来的唐中华，他的反应比守卫还要迅速，不用一秒就飞上屋顶。
en_us: The people inside the house had been alarmed by the movement on the roof, including Tang ZhongHua who had just returned. His reaction was even faster than the guards and he flew onto the roof in less than a second.

source: 屋前正在炼丹且进行到最后凝丹阶段的游小默忍不住皱了眉，他虽然习惯心无旁骛，但是耳边一直传来这种声响，精神再集中也无视不了。
en_us: You XiaoMo was in front of the house. He was in the middle of refining pills and was currently at the last stage of forming the pill. He could not help frowning. Although he was used to blocking out all distractions, he was unable to concentrate no matter how he tried to ignore it with such a sound always by his ears.

source: 展览台每件物品前都有一个小箱子，确定自己要竞价的物品后，将自己的名字和出的价格或东西一道写在一张白色的小卡片里，然后放进小箱子，待时间结束后，轮回楼的人就会将箱子里的卡片都拿出来对比，估价后再把出价最高的那张卡片拿出来。
en_us: In front of each item in the display case, there was a small box. After confirming what item you wanted to bid for, you could write your name and the price or items you were offering on a small white card and place it in the box. After the deadline, the people of Tower Samsara would take the cards out for comparison and pick the one with the highest value afer evaluating them all.

source: 展雨轩的话根本是在胡扯，卫白的身体不好，所以根本不可能过来这边，何况他们这边的人都是沾别人的光才能进来参加宴会，都是没有名气的小人物，又有谁会注意到这边的情况。
en_us: Zhan YuXuan

source: 展雨轩不过随口扯两句而已，偏偏赤血家族那个弟子就信了，还真的把人带出去，说他脑子简单，还不如说他没脑子。
en_us: Zhan YuXuan merely spoke without thinking. Unfortunately that Vermilion Blood Clan disciple believed it and even brought the person over. Instead of saying that he was simple-minded, he might as well have said that he had no brains.

source: 展雨轩将银戈从赤血家族那名弟子得到的玉盒子拿出来，“还是老样子，我想应该和这只玉盒子里的蛊有关。”
en_us: Zhan YuXuan took out the jade box that Yin Ge got from that the disciple from the Vermilion Blood Clan, "He's still the same. I think it should be related to Gu inside this jade box." <strong>t/n: As per Wikipedia, Gu is a poison from a legendary venomous insect created by sealing several venomous creatures (e.g., centipede, snake, scorpion) inside a closed container, where they devour one another and allegedly concentrated their toxins into a single survivor. Gu was used in black magic practices such as manipulating sexual partners, creating malignant diseases, and causing death.</strong>

source: 展雨轩思索道：“难道子蛊察觉到凌霄的实力，所以在害怕？”
en_us: Zhan YuXuan pondered, "Could it be that the child Gu was afraid because it was able to perceive Ling Xiao's strength?"

source: 展雨轩猜想，大概是因为游震天他们太过放心，所以才敢只派一名弟子看着风迟云，而且风迟云的情况也不用担心他会逃跑。
en_us: Zhan YuXuan guessed that it was probably because You ZhenTian and the rest were too relaxed, so they dared to dispatch just a single disciple to watch over Feng ChiYun. Furthermore, there was no need to worry that Feng ChiYun would escape with his current circumstances.

source: 展雨轩见银戈没有回来，就知道他得手了。
en_us: Zhan YuXuan knew that their objective had been achieved upon seeing that Yin Ge did not return.

source: 展雨轩跟在他们身后，顺便带上小木屋的门。
en_us: Zhan YuXuan followed behind them and shut the door of the little wooden house behind him.

source: 山峰依旧是光秃秃的，改变的会死山峰的位置以及数量，明眼人一看就知道这是阵法与禁止的结合，但最高的那座峰却没有改变分毫。
en_us: The mountain peak was still as bare as before. What changed was the position and the number of mountain peaks (会死山峰). A perspicacious person would be able to tell with one look that this was a integration of formation and restriction arrays (阵法与禁止). However, there was not the slightest change in the highest peak.

source: 山洞的存在已经很多年，看痕迹似乎是远古一些前辈的洞府，可惜东西已经被搬空了，只有一些破旧的石椅和石床。
en_us: The cave had existed for many years and it seemed to be the dwelling of some predecessors from the ancient times based on the traces left behind. Unfortunately, the entire cave had been emptied, with only some old stone chairs and beds left behind.

source: 岂不是便宜了其他人？”说到其他人，他还有意看了赤血家族几人一眼。
en_us: Wouldn't that just be conveniencing other people?" When he mentioned other people, he looked meaningfully at the people from the Vermillion Blood Clan.

source: 岂能被一只牲畜玩弄。
en_us: How could one be toyed with by a domesticated animal?

source: 岳父跪拜女婿这种事情绝对不能发生在他身上，不小心也不行。
en_us: There was no way that kind of 'father kowtows to the son-in-law' thing could happen to him, not even by accident.

source: 左右邻居对王老板的为人是很了解的，见他笑而不语，一个老板娘突然将话题转到他身上。
en_us: His neighbours were knowledgable about what kind of person he was and seeing that he was just smiling, a female shopkeeper suddenly changed the topic to him.

source: 左炎是个身材魁梧的男子，长相略粗狂，阳刚之气颇重，模样虽然年轻，但已经不能算是年轻一辈，几万年前就他已经拜苍盟盟主为师，如今苍盟许多事情皆是由他做主。
en_us: Zuo Yan was a well built man, his features ruggedly handsome, very masculine. Though he looked young, he wasn't a part of the youth anymore. Tens of thousands of year ago, he had become a disciple of the Head of the Cang Alliance. Nowadays, he held power over many decisions in the Cang Alliance.

source: 巧的是，张管事这段时间也一直想找李管事说苏朗那件事。
en_us: Coincidentally, Manager Zhang had also been searching for Manager Li the entire time in order to discuss Su Lang.

source: 巨大的城门守着二十个守卫，每个守卫的修为都在皇境到帝境之间，这些守卫正在对那些想进城的人进行严格的检查。
en_us: The immense city gates were defended by twenty guards who were carrying out strict checks on those who wished to enter the city. Each had a cultivation between the Imperial Realm and the Emperor Realm.

source: 巨大的爆炸声地动山摇，仅一支箭羽就将城门炸碎了，距离近的都被波及到，有些人被碎石砸到，差点没跳脚。
en_us: With a huge explosion, the arrow destroyed the gates entirely and those were close were caught up in the blast. Some people were hit by the debris, jumping.

source: 巨无霸每一层都有一种牌子，代表着不同的楼层，只有用这块牌子才能上去九十层，不然守着九十层的导师是不会管你是不是脸熟，他会直接把你拒在外面。
en_us: Every level of the Giganticus (巨无霸) had a different plaque which represented different levels. You could only enter the ninetieth level with this plaque, otherwise, the teacher guarding the ninetieth level would directly refuse entry no matter if you were a familiar person or not.

source: 巩固的过程比晋级要顺利得多，完全没有任何阻碍，不过为了完全吸收固心丹的药效，游小默这一次打坐花掉了他将近十天，一切仿佛水到渠成，当他准备收手的时候却意外突破了。
en_us: The process of consolidation went much more smoothly than advancement; there were no obstacles at all. However, to fully absorb the effects of the Heart Fortification Pill, You XiaoMo spent ten whole days there. Everything was going as planned, but right when he was about to stop, he abruptly achieved breakthrough.

source: 已经负二位数的游小默坚决拒绝负三位数，好吧，老子大人大量，这次就不跟脑子有问题的人计较了。
en_us: Since he was already in the double digit negatives, You XiaoMo stood firm in not falling to the triple digits. Okay, I'm a man with a big heart, and I'm not going to be bothered by stupid people.
